app/controllers/dragons_controller.rb

  def index
    @dragons = Dragon.all
---
SELECT "dragons".* FROM "dragons"

  def create
    @dragon = Dragon.new(dragon_params)

    respond_to do |format|
      if @dragon.save
---
INSERT INTO "dragons" ("name", "universe_id", "size", "description", "image", "created_at", "updated_at") VALUES ('Drogon', 1, 'Grand', 'Description drogon', 'https://fr.web.img3.acsta.net/newsv7/17/07/21/15/44/3699120.jpg', '2025-02-20 11:35:51.183655', '2025-02-20 11:35:51.183655') RETURNING "id"

    def set_dragon
      @dragon = Dragon.find(params.expect(:id))
---
SELECT "dragons".* FROM "dragons" WHERE "dragons"."id" = 1 LIMIT 1