app/controllers/universes_controller.rb

  def index
    @universes = Universe.all
---
SELECT "universes".* FROM "universes"

  def create
    @universe = Universe.new(universe_params)

    respond_to do |format|
      if @universe.save
---
INSERT INTO "universes" ("name", "release_date", "description_universe", "created_at", "updated_at") VALUES ('Games Of Thrones', 2011, 'Games Of Thrones est une série télévisée fantastique.', '2025-02-20 11:03:35.013811', '2025-02-20 11:03:35.013811') RETURNING "id"

  def destroy
    @universe.destroy!
---
DELETE FROM "universes" WHERE "universes"."id" = 1

    def set_universe
      @universe = Universe.find(params.expect(:id))
---
SELECT "universes".* FROM "universes" WHERE "universes"."id" = 1 LIMIT 1